return {
    -- disables the snacks default dashboard
    {
        "folke/snacks.nvim",
        opts = {
            dashboard = { enabled = false },
        },
    },
    {
        "nvimdev/dashboard-nvim",
        event = "VimEnter", -- Better than lazy=false for dashboards
        dependencies = { "nvim-tree/nvim-web-devicons" },
        opts = function()
            math.randomseed(os.time())
            local logos = {
                [[
▄▄▄    ▄▄▄  ▄▄▄▄▄▄▄   ▄▄▄▄▄   ▄▄▄▄  ▄▄▄▄ ▄▄▄▄▄ ▄▄▄      ▄▄▄ 
████▄  ███ ███▀▀▀▀▀ ▄███████▄ ▀███  ███▀  ███  ████▄  ▄████ 
███▀██▄███ ███▄▄    ███   ███  ███  ███   ███  ███▀████▀███ 
███  ▀████ ███      ███▄▄▄███  ███▄▄███   ███  ███  ▀▀  ███ 
███    ███ ▀███████  ▀█████▀    ▀████▀   ▄███▄ ███      ███ 
                ]],
                [[
,---.   .--.    .-''-.      ,-----.    ,---.  ,---..-./`) ,---.    ,---. 
|    \  |  |  .'_ _   \   .'  .-,  '.  |   /  |   |\ .-.')|    \  /    | 
|  ,  \ |  | / ( ` )   ' / ,-.|  \ _ \ |  |   |  .'/ `-' \|  ,  \/  ,  | 
|  |\_ \|  |. (_ o _)  |;  \  '_ /  | :|  | _ |  |  `-'`"`|  |\_   /|  | 
|  _( )_\  ||  (_,_)___||  _`,/ \ _/  ||  _( )_  |  .---. |  _( )_/ |  | 
| (_ o _)  |'  \   .---.: (  '\_/ \   ;\ (_ o._) /  |   | | (_ o _) |  | 
|  (_,_)\  | \  `-'    / \ `"/  \  ) /  \ (_,_) /   |   | |  (_,_)  |  | 
|  |    |  |  \       /   '. \_/``".'    \     /    |   | |  |      |  | 
'--'    '--'   `'-..-'      '-----'       `---`     '---' '--'      '--' 
                ]],
                [[
   ▄▄     ▄▄▄   ▄▄▄▄▄▄▄    ▄▄▄▄      ▄▄▄         ▄▄▄▄▄▄  ▄▄▄     ▄▄▄  
   ██▄   ██▀   █▀██▀▀▀   ▄█▀▀████▄  █▀██  ██▀▀  █▀ ██     ███▄ ▄███   
   ███▄  ██      ██      ██    ██     ██  ██       ██     ██ ▀█▀ ██   
   ██ ▀█▄██      ████    ██    ██     ██  ██       ██     ██     ██   
   ██   ▀██      ██      ██    ██     ██▄ ██       ██     ██     ██   
 ▀██▀    ██      ▀█████   ▀████▀       ▀███▀     ▄▄██▄▄ ▀██▀     ▀██▄ 
                ]],
                [[
   _     _      _     _      _     _      _     _      _     _      _     _   
  (c).-.(c)    (c).-.(c)    (c).-.(c)    (c).-.(c)    (c).-.(c)    (c).-.(c)  
   / ._. \      / ._. \      / ._. \      / ._. \      / ._. \      / ._. \   
 __\( Y )/__  __\( Y )/__  __\( Y )/__  __\( Y )/__  __\( Y )/__  __\( Y )/__ 
(_.-/'-'\-._)(_.-/'-'\-._)(_.-/'-'\-._)(_.-/'-'\-._)(_.-/'-'\-._)(_.-/'-'\-._)
   || N ||      || E ||      || O ||      || V ||      || I ||      || M ||   
 _.' `-' '._  _.' `-' '._  _.' `-' '._  _.' `-' '._  _.' `-' '._  _.' `-' '._ 
(.-./`-'\.-.)(.-./`-'\.-.)(.-./`-'\.-.)(.-./`-'\.-.)(.-./`-'\.-.)(.-./`-'\.-.)
 `-'     `-'  `-'     `-'  `-'     `-'  `-'     `-'  `-'     `-'  `-'     `-' 
                ]],
                [[
███▄▄▄▄      ▄████████  ▄██████▄   ▄█    █▄   ▄█    ▄▄▄▄███▄▄▄▄   
███▀▀▀██▄   ███    ███ ███    ███ ███    ███ ███  ▄██▀▀▀███▀▀▀██▄ 
███   ███   ███    █▀  ███    ███ ███    ███ ███▌ ███   ███   ███ 
███   ███  ▄███▄▄▄     ███    ███ ███    ███ ███▌ ███   ███   ███ 
███   ███ ▀▀███▀▀▀     ███    ███ ███    ███ ███▌ ███   ███   ███ 
███   ███   ███    █▄  ███    ███ ███    ███ ███  ███   ███   ███ 
███   ███   ███    ███ ███    ███ ███    ███ ███  ███   ███   ███ 
 ▀█   █▀    ██████████  ▀██████▀   ▀██████▀  █▀    ▀█   ███   █▀  
                ]],
                [[
     .-') _   ('-.                     (`-.           _   .-')    
    ( OO ) )_(  OO)                  _(OO  )_        ( '.( OO )_  
,--./ ,--,'(,------. .-'),-----. ,--(_/   ,. \ ,-.-') ,--.   ,--.)
|   \ |  |\ |  .---'( OO'  .-.  '\   \   /(__/ |  |OO)|   `.'   | 
|    \|  | )|  |    /   |  | |  | \   \ /   /  |  |  \|         | 
|  .     |/(|  '--. \_) |  |\|  |  \   '   /,  |  |(_/|  |'.'|  | 
|  |\    |  |  .--'   \ |  | |  |   \     /__),|  |_.'|  |   |  | 
|  | \   |  |  `---.   `'  '-'  '    \   /   (_|  |   |  |   |  | 
`--'  `--'  `------'     `-----'      `-'      `--'   `--'   `--' 
                ]],
                [[
                 _        _______  _______          _________ _______ 
( (    /|(  ____ \(  ___  )|\     /|\__   __/(       )
|  \  ( || (    \/| (   ) || )   ( |   ) (   | () () |
|   \ | || (__    | |   | || |   | |   | |   | || || |
| (\ \) ||  __)   | |   | |( (   ) )   | |   | |(_)| |
| | \   || (      | |   | | \ \_/ /    | |   | |   | |
| )  \  || (____/\| (___) |  \   /  ___) (___| )   ( |
|/    )_)(_______/(_______)   \_/   \_______/|/     \|
                                                      
                ]],
            }
            local logo = logos[math.random(#logos)]
            logo = string.rep("\n", 8) .. logo .. "\n\n"

            local opts = {
                theme = "doom",
                hide = {
                    statusline = false,
                },
                config = {
                    header = vim.split(logo, "\n"),
          -- stylua: ignore
          center = {
            { action = 'lua LazyVim.pick()()',                           desc = " Find File",       icon = " ", key = "f" },
            { action = "ene | startinsert",                              desc = " New File",        icon = " ", key = "n" },
            { action = 'lua LazyVim.pick("oldfiles")()',                 desc = " Recent Files",    icon = " ", key = "r" },
            { action = 'lua LazyVim.pick("live_grep")()',                desc = " Find Text",       icon = " ", key = "g" },
            { action = 'lua LazyVim.pick.config_files()()',              desc = " Config",          icon = " ", key = "c" },
            { action = 'lua require("persistence").load()',              desc = " Restore Session", icon = " ", key = "s" },
            { action = "LazyExtras",                                     desc = " Lazy Extras",     icon = " ", key = "x" },
            { action = "Lazy",                                           desc = " Lazy",            icon = "󰒲 ", key = "l" },
            { action = function() vim.api.nvim_input("<cmd>qa<cr>") end, desc = " Quit",            icon = " ", key = "q" },
          },
                    footer = function()
                        local stats = require("lazy").stats()
                        local ms = (math.floor(stats.startuptime * 100 + 0.5) / 100)
                        return {
                            "⚡ Neovim loaded " .. stats.loaded .. "/" .. stats.count .. " plugins in " .. ms .. "ms",
                        }
                    end,
                },
            }

            for _, button in ipairs(opts.config.center) do
                button.desc = button.desc .. string.rep(" ", 43 - #button.desc)
                button.key_format = "  %s"
            end

            -- open dashboard after closing lazy
            if vim.o.filetype == "lazy" then
                vim.api.nvim_create_autocmd("WinClosed", {
                    pattern = tostring(vim.api.nvim_get_current_win()),
                    once = true,
                    callback = function()
                        vim.schedule(function()
                            vim.api.nvim_exec_autocmds("UIEnter", { group = "dashboard" })
                        end)
                    end,
                })
            end

            return opts
        end,
    },
}
